Repository: sillsdev/Glyssen
Catalog: DistFiles/localization/Glyssen.fr.tmx
Source language: fr
Languages: en

source: Yezania ***the*** prêtre, sacrificateur ***(during*** ***reign*** ***of*** Ozias, Azaria)
en: Azariah the priest (during reign of Uzziah)

source: Barzillaï ***(old)***
en: Barzillai (old)

source: Israélite ***spies*** Josué ***sent*** ***to*** Aï
en: Israelite spies Joshua sent to Ai

source: Mefibocheth, ***son*** ***of*** Jonatan
en: Mephibosheth, son of Jonathan

source: Agour
en: Agur

source: Ananias: (1) mari de Sapphira ***of*** ***Jerusalem***
en: Ananias of Jerusalem

source: Claude
en: Claudius

source: Élymas
en: Elymas

source: Hémam, Yedoutoun ***and*** ***the*** ***rest*** ***of*** ***those*** ***chosen*** ***to*** ***give*** ***thanks***
en: Heman, Jeduthun and the rest of those chosen to give thanks

source: Ésaïe ***the*** prophète
en: Isaiah the prophet

source: Jacques, ***the*** disciple, élève, partisan
en: James, the disciple

source: roi // [2] Mélek
en: king

source: Natan ***the*** prophète
en: Nathan the prophet

source: Pierre
en: Peter

source: Pharisien
en: Pharisee

source: Pierre (Céphas)
en: Peter (Cephas)

source: Jésus (Seigneur Dieu, le Tout-Puissant)
en: Jesus (Lord God Almighty)

source: prêtre
en: priest
